## Terraform Plan Output - nprd - hub
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_virtual_network.vnet has changed
  ~ resource "azurerm_virtual_network" "vnet" {
      ~ address_space           = [
          - "172.20.0.0/20",
          + "10.1.0.0/16",
        ]
        id                      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw"
        name                    = "dbdemo-nprd-hub-eastus-fw"
        tags                    = {
            "environment" = "nprd"
            "owner"       = "av"
            "role"        = "hub_virtual_network"
            "source"      = "terraform"
            "stack"       = "hub"
        }
        # (6 unchanged attributes hidden)
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_virtual_network.vnet has changed
  ~ resource "azurerm_virtual_network" "vnet" {
      ~ address_space           = [
          - "172.21.0.0/20",
          + "10.2.0.0/16",
        ]
        id                      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw"
        name                    = "dbdemo-nprd-hub-eastus2-fw"
        tags                    = {
            "environment" = "nprd"
            "owner"       = "av"
            "role"        = "hub_virtual_network"
            "source"      = "terraform"
            "stack"       = "hub"
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-GatewaySubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-ServiceNowVMs"] will be destroyed
  # (because key ["eastus-ServiceNowVMs"] is not in for_each map)
  - resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      - id             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/ServiceNowVMs" -> null
      - route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus" -> null
      - subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/ServiceNowVMs" -> null
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-ServiceNowVM"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-ehsplunk"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-integration"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-integration2"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-integration3"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-pvtendpoint"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-vmss"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-GatewaySubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-ServiceNowVMs"] will be destroyed
  # (because key ["eastus2-ServiceNowVMs"] is not in for_each map)
  - resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      - id             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw/subnets/ServiceNowVMs" -> null
      - route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2" -> null
      - subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw/subnets/ServiceNowVMs" -> null
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-ServiceNowVM"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-ehsplunk"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-integration"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-integration2"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-integration3"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-pvtendpoint"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-vmss"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.virtual_network_diagnostics["eastus"].azurerm_monitor_diagnostic_setting.diag will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diag" {
        id                             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw|dbdemo-nprd-hub-eastus-fw-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "dbdemo-nprd-hub-eastus-fw-diag"
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.hub.module.virtual_network_diagnostics["eastus2"].azurerm_monitor_diagnostic_setting.diag will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diag" {
        id                             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw|dbdemo-nprd-hub-eastus2-fw-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "dbdemo-nprd-hub-eastus2-fw-diag"
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["AzureBastionSubnet"] will be updated in-place
  ~ resource "azurerm_subnet" "subnet" {
      ~ address_prefixes                               = [
          - "10.1.0.64/26",
          + "172.20.4.0/23",
        ]
        id                                             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/AzureBastionSubnet"
        name                                           = "AzureBastionSubnet"
        # (8 unchanged attributes hidden)
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.2.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.96/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "GatewaySubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["ServiceNowVMs"] will be destroyed
  # (because key ["ServiceNowVMs"] is not in for_each map)
  - resource "azurerm_subnet" "subnet" {
      - address_prefixes                               = [
          - "10.1.1.0/24",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/ServiceNowVMs" -> null
      - name                                           = "ServiceNowVMs" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "dbdemo-nprd-hub-eastus-rg" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw" -> null
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-ServiceNowVM"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.64/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-ServiceNowVM"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-ehsplunk"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.48/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-ehsplunk"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-integration"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.0/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-integration"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-integration2"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.16/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-integration2"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-integration3"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.32/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-integration3"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-pvtendpoint"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.8.0/21",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-pvtendpoint"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-vmss"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.6.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-vmss"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus"].azurerm_virtual_network.vnet will be updated in-place
  ~ resource "azurerm_virtual_network" "vnet" {
      ~ address_space           = [
          - "10.1.0.0/16",
          + "172.20.0.0/20",
        ]
        id                      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw"
        name                    = "dbdemo-nprd-hub-eastus-fw"
        tags                    = {
            "environment" = "nprd"
            "owner"       = "av"
            "role"        = "hub_virtual_network"
            "source"      = "terraform"
            "stack"       = "hub"
        }
        # (6 unchanged attributes hidden)
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["AzureBastionSubnet"] will be updated in-place
  ~ resource "azurerm_subnet" "subnet" {
      ~ address_prefixes                               = [
          - "10.2.0.64/26",
          + "172.20.4.0/23",
        ]
        id                                             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw/subnets/AzureBastionSubnet"
        name                                           = "AzureBastionSubnet"
        # (8 unchanged attributes hidden)
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.2.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.96/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "GatewaySubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["ServiceNowVMs"] will be destroyed
  # (because key ["ServiceNowVMs"] is not in for_each map)
  - resource "azurerm_subnet" "subnet" {
      - address_prefixes                               = [
          - "10.2.1.0/24",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw/subnets/ServiceNowVMs" -> null
      - name                                           = "ServiceNowVMs" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw" -> null
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-ServiceNowVM"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.64/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-ServiceNowVM"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-ehsplunk"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.48/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-ehsplunk"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-integration"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.0/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-integration"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-integration2"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.16/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-integration2"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-integration3"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.32/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-integration3"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-pvtendpoint"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.8.0/21",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-pvtendpoint"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-vmss"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.6.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-vmss"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_virtual_network.vnet will be updated in-place
  ~ resource "azurerm_virtual_network" "vnet" {
      ~ address_space           = [
          - "10.2.0.0/16",
          + "172.21.0.0/20",
        ]
        id                      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw"
        name                    = "dbdemo-nprd-hub-eastus2-fw"
        tags                    = {
            "environment" = "nprd"
            "owner"       = "av"
            "role"        = "hub_virtual_network"
            "source"      = "terraform"
            "stack"       = "hub"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 36 to add, 6 to change, 4 to destroy.

Changes to Outputs:
  ~ hub_networks                = {
      ~ eastus  = {
            id                    = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw"
            name                  = "dbdemo-nprd-hub-eastus-fw"
          ~ subnets_name_id       = {
              + AzureFirewallSubnet                      = (known after apply)
              + GatewaySubnet                            = (known after apply)
              - ServiceNowVMs                            = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/ServiceNowVMs"
              + dbdemo-nprd-hub-eastus-snet-ServiceNowVM = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-ehsplunk     = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-integration  = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-integration2 = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-integration3 = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-pvtendpoint  = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-vmss         = (known after apply)
                # (1 unchanged attribute hidden)
            }
            # (4 unchanged attributes hidden)
        }
      ~ eastus2 = {
            id                    = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw"
            name                  = "dbdemo-nprd-hub-eastus2-fw"
          ~ subnets_name_id       = {
              + AzureFirewallSubnet                      = (known after apply)
              + GatewaySubnet                            = (known after apply)
              - ServiceNowVMs                            = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw/subnets/ServiceNowVMs"
              + dbdemo-nprd-hub-eastus-snet-ServiceNowVM = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-ehsplunk     = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-integration  = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-integration2 = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-integration3 = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-pvtendpoint  = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-vmss         = (known after apply)
                # (1 unchanged attribute hidden)
            }
            # (4 unchanged attributes hidden)
        }
    }
  ~ hub_route_tables            = {
      ~ eastus  = {
            id     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
            name   = "route-eastus"
          ~ routes = [
              ~ {
                    name                   = "internet"
                  ~ next_hop_in_ip_address = null -> ""
                    # (2 unchanged attributes hidden)
                },
                {
                    address_prefix         = "172.21.0.0/20"
                    name                   = "eastus2-172.21.0.0-20"
                    next_hop_in_ip_address = "1.2.3.4"
                    next_hop_type          = "VirtualAppliance"
                },
            ]
        }
      ~ eastus2 = {
            id     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
            name   = "route-eastus2"
          ~ routes = [
              ~ {
                    name                   = "internet"
                  ~ next_hop_in_ip_address = null -> ""
                    # (2 unchanged attributes hidden)
                },
                {
                    address_prefix         = "172.20.0.0/20"
                    name                   = "eastus-172.20.0.0-20"
                    next_hop_in_ip_address = "1.2.3.4"
                    next_hop_type          = "VirtualAppliance"
                },
            ]
        }
    }
```
</details>